In [1]:
import numpy as np
import pandas as pd

In [6]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [7]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data[0]=None

In [10]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [11]:
from numpy import nan as NA

In [12]:
data=pd.Series([1,NA,3.5,NA,7])

In [13]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [14]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
cleaned=data.dropna()

In [19]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[4]=NA

In [23]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
df=pd.DataFrame(np.random.randn(7,3))

In [26]:
df

          0         1         2
0  1.934890 -2.529026 -1.845643
1  0.612460 -0.601552 -1.186203
2 -0.165898  1.796554  0.347842
3  0.468139  0.259126  0.325129
4 -1.115211 -0.838811 -0.981475
5  0.177123  0.428325 -0.919162
6 -1.432960 -0.519946  0.494485

In [27]:
df.iloc[:4,1]=NA

In [29]:
df.iloc[:2,2]=NA

In [30]:
df

          0         1         2
0  1.934890       NaN       NaN
1  0.612460       NaN       NaN
2 -0.165898       NaN  0.347842
3  0.468139       NaN  0.325129
4 -1.115211 -0.838811 -0.981475
5  0.177123  0.428325 -0.919162
6 -1.432960 -0.519946  0.494485

In [31]:
df.dropna()

          0         1         2
4 -1.115211 -0.838811 -0.981475
5  0.177123  0.428325 -0.919162
6 -1.432960 -0.519946  0.494485

In [32]:
df.dropna(thresh=2)

          0         1         2
2 -0.165898       NaN  0.347842
3  0.468139       NaN  0.325129
4 -1.115211 -0.838811 -0.981475
5  0.177123  0.428325 -0.919162
6 -1.432960 -0.519946  0.494485

In [34]:
df.fillna(0)

          0         1         2
0  1.934890  0.000000  0.000000
1  0.612460  0.000000  0.000000
2 -0.165898  0.000000  0.347842
3  0.468139  0.000000  0.325129
4 -1.115211 -0.838811 -0.981475
5  0.177123  0.428325 -0.919162
6 -1.432960 -0.519946  0.494485

In [36]:
df.fillna({1:0.5,2:1})

          0         1         2
0  1.934890  0.500000  1.000000
1  0.612460  0.500000  1.000000
2 -0.165898  0.500000  0.347842
3  0.468139  0.500000  0.325129
4 -1.115211 -0.838811 -0.981475
5  0.177123  0.428325 -0.919162
6 -1.432960 -0.519946  0.494485

In [38]:
df.fillna(0,inplace=True)

In [39]:
df

          0         1         2
0  1.934890  0.000000  0.000000
1  0.612460  0.000000  0.000000
2 -0.165898  0.000000  0.347842
3  0.468139  0.000000  0.325129
4 -1.115211 -0.838811 -0.981475
5  0.177123  0.428325 -0.919162
6 -1.432960 -0.519946  0.494485

In [40]:
df=pd.DataFrame(np.random.randn(6,3))

In [42]:
df.iloc[2:,1]=NA

In [43]:
df.iloc[4:,2]=NA

In [44]:
df

          0         1         2
0 -1.021036  0.295680  0.307691
1 -1.272970  0.594885 -0.541627
2  0.894319       NaN  0.483780
3 -0.257730       NaN  0.941275
4  1.583315       NaN       NaN
5 -0.063261       NaN       NaN

In [45]:
df.fillna(method='ffill')

          0         1         2
0 -1.021036  0.295680  0.307691
1 -1.272970  0.594885 -0.541627
2  0.894319  0.594885  0.483780
3 -0.257730  0.594885  0.941275
4  1.583315  0.594885  0.941275
5 -0.063261  0.594885  0.941275

In [46]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -1.021036  0.295680  0.307691
1 -1.272970  0.594885 -0.541627
2  0.894319  0.594885  0.483780
3 -0.257730  0.594885  0.941275
4  1.583315       NaN  0.941275
5 -0.063261       NaN  0.941275

In [47]:
data=pd.Series([1.,NA,3.5,NA,7])

In [48]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [49]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [52]:
data=pd.DataFrame({'k1':['one','two'] * 3 + ['two'],
                  'k2':[1,1,2,3,3,4,4]})

In [53]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [54]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [55]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [56]:
data['v1']=range(7)

In [57]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [58]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [59]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [60]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon',
                           'Pastrami','corned beef','Bacon',
                            'pastrami','honey ham','nova lox'],
                   'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [61]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [62]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork': 'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [63]:
lowercased=data['food'].str.lower()

In [65]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [66]:
data['animal']=lowercased.map(meat_to_animal)

In [67]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [68]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [69]:
data=pd.Series([1.,-999,2.,-999.,-1000.,3.])

In [70]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [71]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [72]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [73]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [75]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                  index=['Ohio','Colordao','NEw York'],
                  columns=['one','two','three','four'])

In [76]:
data

          one  two  three  four
Ohio        0    1      2     3
Colordao    4    5      6     7
NEw York    8    9     10    11

In [82]:
transform=lambda x:x[:4].upper()

In [84]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [85]:
data.index=data.index.map(transform)

In [86]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [87]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [88]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [89]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [90]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)

In [91]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [92]:
ages=[20,22,25,27,21,23,37,31,61,61,45,41,32]

In [93]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 61, 45, 41, 32]

In [94]:
bins=[18,25,35,60,100]

In [96]:
cats=pd.cut(ages,bins)

In [97]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (60, 100], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 13
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [99]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 3, 2, 2, 1], dtype=int8)

In [100]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [101]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    2
dtype: int64

In [103]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [61, 100), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 13
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [105]:
group_names=['Youth','YoungAdult','MiddleAges','Senior']

In [106]:
group_names

['Youth', 'YoungAdult', 'MiddleAges', 'Senior']

In [107]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., Senior, Senior, MiddleAges, MiddleAges, YoungAdult]
Length: 13
Categories (4, object): [Youth < YoungAdult < MiddleAges < Senior]

In [2]:
data=np.random.rand(20)

In [3]:
pd.cut(data,4,precision=2)

[(0.76, 0.98], (0.54, 0.76], (0.11, 0.33], (0.33, 0.54], (0.76, 0.98], ..., (0.33, 0.54], (0.11, 0.33], (0.76, 0.98], (0.76, 0.98], (0.11, 0.33]]
Length: 20
Categories (4, interval[float64]): [(0.11, 0.33] < (0.33, 0.54] < (0.54, 0.76] < (0.76, 0.98]]

In [11]:
import numpy as np
import pandas as pd

In [12]:
data=np.random.randn(1000)

In [14]:
cats=pd.qcut(data,4)

In [15]:
cats

[(0.0681, 0.74], (-2.854, -0.613], (0.74, 2.899], (-0.613, 0.0681], (-0.613, 0.0681], ..., (0.0681, 0.74], (-2.854, -0.613], (-2.854, -0.613], (-0.613, 0.0681], (0.74, 2.899]]
Length: 1000
Categories (4, interval[float64]): [(-2.854, -0.613] < (-0.613, 0.0681] < (0.0681, 0.74] < (0.74, 2.899]]

In [16]:
pd.value_counts(cats)

(0.74, 2.899]       250
(0.0681, 0.74]      250
(-0.613, 0.0681]    250
(-2.854, -0.613]    250
dtype: int64

In [17]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(0.0681, 1.263], (-1.251, 0.0681], (1.263, 2.899], (-1.251, 0.0681], (-1.251, 0.0681], ..., (0.0681, 1.263], (-1.251, 0.0681], (-1.251, 0.0681], (-1.251, 0.0681], (0.0681, 1.263]]
Length: 1000
Categories (4, interval[float64]): [(-2.854, -1.251] < (-1.251, 0.0681] < (0.0681, 1.263] < (1.263, 2.899]]

In [18]:
#Detecing and filtering Outliers

In [19]:
data=pd.DataFrame(np.random.randn(1000,4))

In [22]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007729    -0.022213    -0.019409     0.033511
std       1.029132     1.004780     1.022138     1.041574
min      -3.409139    -3.014888    -3.441006    -3.584681
25%      -0.748888    -0.620685    -0.700600    -0.703555
50%       0.026412    -0.021805    -0.013415     0.077412
75%       0.691538     0.648713     0.650714     0.755067
max       3.368642     3.231294     3.213893     3.185389

In [23]:
col=data[2]

In [25]:
col[np.abs(col)>3]

32    -3.441006
232    3.112037
408    3.060480
448    3.213893
Name: 2, dtype: float64

In [26]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
32  -0.109857  0.300597 -3.441006 -1.809803
62  -1.374616  3.108647  0.019268 -0.884730
232  1.773443 -1.876506  3.112037  1.030819
277 -3.032036 -0.397344 -0.200090  1.813663
354  1.591775 -0.943658 -1.485666  3.185389
382 -3.409139 -0.211601  0.275249  0.270140
408  0.837951 -0.544524  3.060480  0.360487
409  3.040835 -0.760802  0.670923 -0.026525
421  0.338906 -3.014888  0.527235  0.094081
448 -0.772417  0.195891  3.213893  0.426130
538  0.735913 -1.824458  0.666130 -3.584681
583 -1.218511  0.634952 -0.394481  3.084406
674  2.104764  3.231294  0.278629 -0.635343
734 -1.604004  3.021382  2.474079 -1.184451
754 -3.004514 -1.068470  0.023050 -2.277458
897  3.368642  1.327251  0.161938  0.601989

In [27]:
data[np.abs(data)>3]=np.sign(data)*3

In [28]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007693    -0.022560    -0.019354     0.033826
std       1.026485     1.003614     1.019579     1.038913
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.748888    -0.620685    -0.700600    -0.703555
50%       0.026412    -0.021805    -0.013415     0.077412
75%       0.691538     0.648713     0.650714     0.755067
max       3.000000     3.000000     3.000000     3.000000

In [29]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1 -1.0  1.0  1.0  1.0
2 -1.0 -1.0 -1.0  1.0
3  1.0 -1.0  1.0  1.0
4 -1.0  1.0 -1.0  1.0

In [30]:
#Permutation and Random Sampling

In [31]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [32]:
sampler=np.random.permutation(5)

In [33]:
sampler

array([0, 4, 3, 2, 1])

In [34]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [35]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [36]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [37]:
choices=pd.Series([5,7,-1,6,4])

In [39]:
draws=choices.sample(n=10,replace=True)

In [40]:
draws

3    6
3    6
3    6
0    5
2   -1
1    7
1    7
3    6
1    7
4    4
dtype: int64

In [41]:
#Computing Indicator/Dummy Variables

In [42]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],
                 'data1':range(6)})

In [43]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [44]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [45]:
dummies=pd.get_dummies(df['key'],prefix='key')

In [46]:
df_with_dummy=df[['data1']].join(dummies)

In [47]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [51]:
#String Manipulation

In [52]:
val='a,b,  guido'

In [53]:
val

'a,b,  guido'

In [54]:
val.split(',')

['a', 'b', '  guido']

In [55]:
pieces=[x.strip() for x in val.split(',')]

In [56]:
pieces

['a', 'b', 'guido']

In [57]:
first,second,third=pieces

In [58]:
first + '::' + second + '::' + third

'a::b::guido'

In [60]:
'::'.join(pieces)

'a::b::guido'

In [61]:
'guido' in val

True

In [62]:
val.index(',')

1

In [64]:
val.find(':')

-1

In [65]:
val.count(',')

2

In [66]:
val.replace(',','::')

'a::b::  guido'

In [67]:
val.replace(',','')

'ab  guido'

In [68]:
#Regular expression

In [69]:
import re

In [70]:
text="foo     bar\t   baz    \tqux"

In [71]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [ ]:
regex=re.compile